tap "fzf"
tap "coinbase/assume-role"
tap "gordonbondon/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/services"
tap "homebrew/versions"
tap "rjcoelho/boneyard"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Library for command-line editing
brew "readline", link: true
# Interpreted, interactive, object-oriented programming language
brew "python"
# Integrated shell for working with the AWS CLI
brew "aws-shell"
# Official Amazon AWS command-line interface
brew "awscli"
# Programmable completion for Bash 3.2
brew "bash-completion"
# preexec and precmd functions for Bash (just like Zsh)
brew "bash-preexec"
# Tool for automated testing of webapps across many browsers
brew "chromedriver"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go dependency management tool
brew "dep"
# Workload Automation System
brew "digdag"
# Load/unload environment variables based on $PWD
brew "direnv"
# Data transfer between various databases, file formats and services
brew "embulk"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Generic library support script
brew "libtool"
# Distributed revision control system
brew "git"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Tools and libraries to manipulate images in many formats
brew "imagemagick@6"
# GNU utilities for networking
brew "inetutils"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# The Kubernetes package manager
brew "kubernetes-helm"
# Tools for observing Kubernetes resources in realtime
brew "kubespy"
# Conversion library
brew "libiconv", link: true
# C library for the MaxMind DB file format
brew "libmaxminddb"
# C XSLT library for GNOME
brew "libxslt", link: true
# Keep your Mac's application settings in sync
brew "mackup"
# Swiss Army knife of email handling
brew "mailutils"
# Java-based project management
brew "maven"
# Open source relational database management system
brew "mysql"
# Network Kanji code conversion Filter (NKF)
brew "nkf"
# Install NodeJS versions
brew "node-build"
# Manage multiple NodeJS versions
brew "nodenv"
# Apache Parquet command-line tools and utilities
brew "parquet-tools"
# Object-relational database system
brew "postgresql"
# Data loading tool for PostgreSQL
brew "pgloader"
# Python dependency management tool
brew "pipenv"
# Ecosystem for IoT development (Arduino and ARM mbed compatible)
brew "platformio"
# Object-relational database system
brew "postgresql@9.6"
# Cloud native development platform
brew "pulumi"
# Password generator
brew "pwgen"
# Python version management
brew "pyenv"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Build tool for Scala projects
brew "sbt"
# Compression/decompression tool based on snappy
brew "snzip"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Code-search similar to ack
brew "the_silver_searcher"
# Google's open source JavaScript engine
brew "v8@3.15"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
brew "coinbase/assume-role/assume-role"
cask "horndis"
cask "hyper"
cask "karabiner-elements"
cask "gordonbondon/tap/session-manager-plugin"
